Tekla.Structures.DrawingInternal.MarkListing


Tekla.Structures.DrawingInternal.MarkListing.GetMenuName(System.String@)


Tekla.Structures.DrawingInternal.MarkListing.TryGetMarks(System.Int32,System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.Int32}@)
Retrieve the IDs of drawing marks and associative notes associated to a given model object in a set of drawing views.
modelObjectId: ID of the model object under consideration
viewIds: list of the IDs of the views where to look for marks. Empty list means all views. (NB: view IDs, not worlds)
marksIds: contains the list of IDs of associated marks and notes
Returns: true in case of success, false otherwise